{"source_type": "web_article", "url": "https://www.raghunath.yoga/", "title": "Raghunath", "text": "I’ve been on such a spiritual quest in this life! From my teens I started a punk/hardcore band called Youth of Today , which championed the principles of clean living, vegetarian diet, and self-control. By the time I was 21, my band had tens of thousands of fans around the world. I was shocked. I started Revelation Records, an indy record label with my high school buddy and signed 20 bands with a similar beliefs and ethics. As exciting as this was, there was a growing void in my heart I knew only Spirit could fill. I got into spirituality, metaphysics, and mysticism; eagerly consuming spiritual classics, my hunger only increased. This eventually manifested as strong desire to go deeper. I split and quit the band. Gave the label to my partner. The teachings of India drove me East and at age 22, I ended up on an ashram floor in the holy village of Vrindavan. That was 1988 — and one of the best choices I made in my life. India before cell phones and satellite TV, what to speak of the internet, was an exotic land. I got to refine and dive deep into my yoga practice, my study of sacred literature and ritual, learn kirtan, cooking, mantra meditation and living simply with nothing except a few robes on my body. I was blessed with integrity-driven teachers who understood the essence of spiritual life. In 1991 I received the name Raghunath (formally Ray Cappo), representing initiation into lineage and a rebirth. I travelled to ashrams all over the world and the holy places of India, and I simply fell in love with the rich spiritual culture. I remained a monk in an ashram for six and a half years and now, many years later, teach how to incorporate everything I learned into everyday life. Basically how to get the spiritual high without leaving the world behind (or in some cases leaving it). Guess what? This stuff works whether you’re a householder or a monk. Presently I’m the opposite of a monk, a householder with three kids. Founder of Supersoul Farm, a school in the countryside in upstate NY. I lead yoga teacher trainings, workshops, retreats, and host a daily podcast, Wisdom of the Sages . Every year I guide sold-out pilgrimages to my favorite cities & villages around India and share all that I know of these places that I love. In the mood of a pilgrim, I teach others how to enter these sacred vortexes, so that they may receive an unforgettable transcendental experience. Since 2016, every January I help provide a game-changing training in India with an ever expanding curriculum and a team of amazing and inspiring teachers. We started with a 300 Hour Yoga Teacher Training which we’ve been refining to be a life changing experience. In 2025 we will also add a 200 hour training in India as well. We teach the sweet culture of yoga which includes not just advanced yoga and pranayama, but sacred literature, kirtan study, Ayurveda for yoga teachers, Ayurvedic cooking, and yoga nidra. For the last few years we’ve added a sucessful second training dedicated exclusively to the study of kirtan. Occasionally I get asked to do a reunion with my band which, when on stage, I realize is extension of everything I speak of today. I’m praying that I can give my students all the life-altering truths of the yoga system that I have learned from my gracious teachers. Hardcore Raghu (Ray Cappo with Youth of Today) Kirtan Raghu (Raghunath Das with friends) Bhakti is the beautiful and natural practice of taking the ego-self out of the center and placing the divine at the center. Bhakti is about service instead of selfishness. By shifting our actions and consciousness away from self-absorption and towards unity-in-diversity, we can begin to see the spark of divinity in all living beings. Distinctions of ‘friend’ and ‘enemy’ fall away. Nations, races, sexes -- even trees, plants, animals and the earth itself -- are seen in an entirely new light; they are seen as citizens under divinity, worthy of respect and dignity. No matter what label we’ve been given or what label we’ve taken on, Bhakti, the process of loving service to the divine and divinity in all life, helps us understand that our real identity is pure spirit soul. We are eternal, blissful, and contain deep intuitive knowledge. We have a deep conviction that we are not born on this planet to hoard, collect, and build fences but in fact, we were born to give love. The current which moves us in our work, our yoga practice, our teaching, our friendship, our relationship with nature, and our family dynamics, serves a clean agenda of desiring to give love to all living beings, as they are part and parcel of God, the Supreme Soul. This is Bhakti, and it is considered by the sages of the yoga tradition to be the highest form of yoga. This is the bigger picture of yoga that has been overlooked, pushed aside and buried. We at Supersoul are here to reestablish and resurrect Bhakti as the essence of yoga, of life itself.", "fetched_at": "2025-09-30T11:28:28.801336", "domain": "www.raghunath.yoga", "text_hash": "sha256:e921f074f8e762411317048f274b01372a066771f6ac51f768ff0d3cdfe930d6", "estimated_tokens": 1230}
{"source_type": "web_link", "url": "https://www.yogaeasy.com/yogalehrer/raghunath-cappo", "title": "https://www.yogaeasy.com/yogalehrer/raghunath-cappo", "text": "", "fetched_at": "2025-09-30T11:28:29.810394", "domain": "www.yogaeasy.com", "text_hash": "", "estimated_tokens": 0}
{"source_type": "web_article", "url": "https://www.richroll.com/podcast/raghunath-cappo-829/", "title": "From Punk to Monk: Raghunath Cappo on The Wisdom of The Sages, Bhakti Yoga & The Pursuit of a Spiritual Life", "text": "Podcast: Play in new window | Download | Embed These decisions chart the course of our spiritual evolution or devolution from moment to moment. The food and drink we consume, the sounds we absorb, and the sights we take in all influence our thoughts, actions, and how we treat ourselves and others. My guest today is Raghunath (Ray) Cappo, a hardcore punk icon turned modern-day spiritual warrior and Bhakti yoga devotee, who is back for his second appearance (episode 583). During the raucous 1980s hardcore punk scene of New York City’s Lower East Side, a young Ray was at the forefront—his band Youth of Today championing the straight-edge principles of clean living, vegetarianism, and self-control. With a devout following, chart-topping records, and a burgeoning label, Ray had achieved punk rock success well before his 20s. Yet, despite this, his spiritual journey was just beginning. Despite the accolades, Ray felt an existential void that success alone could not fill. This spiritual yearning prompted him to abruptly abandon it all and buy a one-way ticket to India—the sacred land that stirred his spiritual longing. What unfolded was a remarkable pilgrimage that whisked Ray from the bustling streets of New York City to the serene ashrams of Vrindavan, where he embraced the ancient wisdom of Bhakti yoga. For six years, he lived as a monk, and Ray became Raghunath. The details of this life-altering journey are captured in his heartfelt new memoir, From Punk to Monk, a testament to the transformative power of spiritual exploration. Today, Raghunath shares his insights on the power of living an authentic spiritual life—one rooted in personal growth, integrity, and recognizing oneself as a spiritual being capable of moving forward gracefully despite life’s challenges. He delves into how yoga extends beyond physical practice, settling the mind through meditation, chanting, and reconnecting with one’s divine nature. Raghunath highlights the spiritual significance of sacred sound, noting the purifying effect practices like kirtan have on consciousness by uncovering the pure soul within. We discuss the importance of intentional morning rituals that shape mindset and actions, service over ego, practicing gratitude, and exercising discernment. We examine the necessity of cultivating a positive mindset by eliminating negative thought patterns as a pathway to inner peace, continued spiritual growth, and more. For those who prefer a visual experience, the conversation is available on YouTube. As always, the audio version streams wild and free on Apple Podcasts and Spotify. From Punk To Monk GIVEAWAY: In honor of Raghunath Cappo’s recent appearance on the podcast, we’re giving away 9 free copies of his new book, From Punk To Monk to listeners of the show, signed by both Raghunath and Rich. If you would like to enter the giveaway, fill out THIS FORM. Enter by Friday, May 10th, 2024 to secure your entry. No purchase is necessary. See Official Rules ( www.richroll.com/official-rules ) and our Privacy Policy ( www.richroll.com/privacy ) for details. And many thanks to Raghunath for this generous offer. Raghunath’s story is one of a soul’s courageous journey from angst and alienation to vulnerability and self-discovery. It’s about trading self-absorption for unity, ego for eternity, and selfishness for selfless service to the divine that resides within us all. Peace + Plants, Bon Charge: The world’s widest range of wellness products designed to help you sleep better, recover faster, and boost your overall well-being. My favorite is their Red Light Face Mask—check out all of their premium offerings at boncharge.com and use code RICHROLL to save 15% OFF. On: Swiss engineering at it’s finest, On crafts high-performance shoes and apparel crafted for comfort and style. Tested by world-class athletes, this gear is built to go the distance, so you can go all out, outdoors. Visit on.com/richroll and enter RichRoll10 at the checkout to get 10% OFF your first order. AG1: 75 whole food sourced ingredients designed to optimize 5 key areas of health, AG1 is the delicious daily habit that sets you up for a healthy future. I take the packets everywhere I go. Try AG1 and get a FREE 1-year supply of Vitamin D3+K2 AND 5 free AG1 Travel Packs with your first purchase exclusively at drinkAG1.com/richroll. Waking Up: A new operating system for your mind, Waking Up offers an extraordinary library of mindfulness resources—meditations, courses on Stoicism, time management practices, and more. Visit wakingup.com/RICHROLL to get a FREE month, plus $30 OFF Brain.fm: Discover the ultimate productivity hack with Brain.fm focus music. Unleash your full potential and conquer your tasks with science-backed sound. Listeners of the show can get 30 days FREE. Try it now at brain.fm/richroll. For a complete list of all RRP sponsors, vanity URLs & discount codes, visit Our Sponsors. There are a few simple ways you can support the show and the content we strive to craft and share every single week Subscribe & Review: Please make sure to review, share comments and subscribe to the show on the various platforms ( Apple Podcasts, YouTube & Spotify ). This helps tremendously! Patronize Our Sponsors: Supporting the companies that support the show! For a complete list of all RRP sponsors and their respective vanity URLs and discount codes, click the ‘Sponsors’ tab in the ‘Shop’ menu. Spread The Word: Help grow our reach by sharing your enthusiasm for the podcast and/or your favorite episodes by posting about it on social media. Thank The Team: I do not do this alone. Send your love to Jason Camiolo for audio engineering, production, show notes and interstitial music; with additional audio engineering by Cale Curtis and additional music by Moby ; Blake Curtis & Dan Drake for video, & editing; graphics by Jessica Miranda & Daniel Solis; portraits by Davy Greenberg, Grayson Wilder & Gizelle Peters ; copywriting by Ben Pryor; and theme music by Tyler Piatt, Trapper Piatt & Hari Mathis. Amazon Disclosure : Third-party books and products denoted on this page and website may be hyperlinked to the Amazon affiliate program. We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites.", "fetched_at": "2025-09-30T11:28:32.504639", "domain": "www.richroll.com", "text_hash": "sha256:76ba609f094465164e8b26765b231dc8a6dafc6aa647a14d480cb19cca0204e3", "estimated_tokens": 1590}
{"source_type": "web_article", "url": "https://www.vitalveda.com.au/learn/circadian-medicine/raghunath-cappo/", "title": "The Rock Star Who Radiates Divine Playfulness, Bhakti Yoga & Life-Altering Truths", "text": "Mantra Shastra Explained: The Ancient Science of Sound | Purnesh #148 August 28, 2025", "fetched_at": "2025-09-30T11:28:39.171299", "domain": "www.vitalveda.com.au", "text_hash": "sha256:abec2e8ff27f5a04967ab6a0f9137b3502d5a0b1b6e8cafda35dad41b18b1240", "estimated_tokens": 21}
{"source_type": "web_article", "url": "https://www.eomega.org/workshops/teachers/raghunath", "title": "Raghunath Omega Institute", "text": "Raghunath is the Kirtan leader and cocreator of Supersoul Farm yoga school and permaculture initiative in the Hudson Valley. He leads yoga teacher trainings at his farm and internationally. He is known for his annual transformational pilgrimage to India, where he teaches sacred literature philosophy, Bhakti, and how to apply it to to contemporary life. Raghunath, born Ray Cappo, was a Lower east side hardcore/punk singer songwriter who toured the globe in his teens. In a decadent music scene, he was an anomaly propounding clean living, positive attitude, and vegetarian lifestyle, inspiring tens of thousands of fans internationally. Since his youth he was fascinated with Eastern thought and started practicing yoga in 1987. The pettiness of the business of music and the untimely death of his father led him to India in 1988 where he dove deeper into the the lifestyle and spirituality of India. He became a celibate monk at a Krishna Bhakti Ashram for six years, where he intensely studied, meditated, and lived the ancient yogic texts.", "fetched_at": "2025-09-30T11:28:42.960848", "domain": "www.eomega.org", "text_hash": "sha256:6bcdd82dd88bc584e44af44661cfc1dcc09c0179962e5c9f49e66b09088771d8", "estimated_tokens": 261}
{"source_type": "web_article", "url": "https://www.yogacitynyc.com/single-post/2013/12/16/meet-the-teach-raghunath-cappo", "title": "Meet The Teach: Raghunath Cappo", "text": "1/2 1/1 Archives", "fetched_at": "2025-09-30T11:28:46.985842", "domain": "www.yogacitynyc.com", "text_hash": "sha256:6f91d64b17717d9e87b5ad26cc92461a4bccd42a887ea00bd579d68f6fb45a56", "estimated_tokens": 4}
{"source_type": "web_article", "url": "https://amyelandry.com/podcast_episode/raghunath-cappo-the-secret-chamber-of-bhakti-yoga/", "title": "Raghunath Cappo - The Secret Chamber of Bhakti Yoga - Amy Landry", "text": ">> Back to all podcasts Raghunath Cappo is a masterful yoga teacher, Bhakti yoga devotee, ex-monk, punk rock icon, and a father of five. Raghu lives in upstate New York on his SuperSoul farm, where he hosts teacher trainings and seva immersions. In his early years, a teenager in search for depth and meaning, he fled his suburban life and went to New York City and found his people, his community. Raghunath – or Ray, as he was known at the time – started a band and a record label, then wild success followed. By the late 1980s Youth Of Today had thousands of fans cementing Raghunath as a leading voice and trendsetter at the centre of the hard-core punk rock culture. Naturally, an existential desire led him to call it quits. In his early 20s he walked away from this life and headed to India on a spiritual pilgrimage that ultimately led him to the holy village of Vrindavan. During this time he fell in love with the wisdom, insight, and traditions of Bhakti yoga. He remained there for six years living as a monk. Hence this is when Ray became Raghunath. Inevitably returning back to the US, he has since pursued a life of sharing the teachings of yoga and taking groups on incredible pilgrimages – or Yatras – within India every year. He also facilitates exceptional yoga teacher trainings annually. Raghunath co-hosts the Wisdom Of The Sages podcast, delving deep into the Bhakti Yoga teachings from the Srimad Bhagavatam. In this episode we unravel: – The pivotal moments along Raghunath's journey thus far which has influenced his work today, including his flipping the script on the punk rock culture of the time. – His experience connecting with the Christian community and the common thread between all belief systems. – True inclusivity, what it looks like, and how we can live it. – The beauty of diversity. – His interest in yoga through a desire for spiritual truth. – The challenge in transmitting the teachings of yoga to the punk rock community, which sharpened his study and spiritual thirst. – Upper case “Love”. – The essence of the Bhakti Yoga tradition. – The path of Bhukti and Mukti. – How to understand the context of the Bhagavad Gita. – The holy vortexes of India. – The value of being held by a teacher when venturing throughout India and holy places. – Raghunath's biggest takeaway and lesson from being a parent. Connect with Raghunath at https://www.raghunath.yoga/ and on Instagram: https://www.instagram.com/raghunathyogi/ Mentioned in this episode: Mahabharata: The Greatest Spiritual Epic of All Time https://www.amarchitrakatha.com/ Srimad Bhagavatam Bhagavad Gita https://www.somethingdivinefilm.com/trailer", "fetched_at": "2025-09-30T11:28:49.857207", "domain": "amyelandry.com", "text_hash": "sha256:05f1a39b174527db91b316bdb0298c7550f26fe148899ed88a324a811d442450", "estimated_tokens": 662}
{"source_type": "web_article", "url": "https://lifeonearth.podbean.com/e/yoga-tradition-wisdom-with-raghunath-cappo/", "title": "Yoga : Wisdom & Tradition with Raghunath Cappo | Life On Earth Podcast", "text": "Yoga : Wisdom & Tradition with Raghunath Cappo | Life On Earth Podcast Version: 20241125", "fetched_at": "2025-09-30T11:28:52.061447", "domain": "lifeonearth.podbean.com", "text_hash": "sha256:2767f1f41acefe3aa55c9e0c1dd280cb2ebd70f71e533b8cdf5df39e8004b922", "estimated_tokens": 22}
{"source_type": "web_article", "url": "https://www.sonima.com/yoga/raghunath/", "title": "Raghunath: The Flight of His Life - Sonima", "text": "On a late September morning in Providence, Rhode Island, around 20 yoga students broke from practicing handstands to watch Raghunath demonstrate a sequence of poses. He reached his arms up and backward, inhaling audibly, then dropped back into a full wheel on the exhale; from the backbend, he rocked into his palms and can-canned both feet overhead, floating into a handstand; then he lowered his legs, toes pointed, through a pike, finally touching down in a full forward fold. “Damn,” sighed one of the studio’s senior teachers, who was taking the class. Raghunath sprung upright. “Okay!” he said, clapping his hands twice. “Who wants to try?” At 48, Raghunath moves with the fluid certainty of a Slinky falling down stairs. During the two-hour Flight School—his signature inversion-focused devotion-fueled workshop—Raghunath taught handstand 10 different ways, performing each variation with hypnotic control. Between demonstrations he paced between mats, offering physical assists and chattering about philosophy. After class, Raghunath and I spoke on the phone as he drove south on I-93 to teach two more workshops in Boston. “Truthfully, if they just want to learn acrobatics and jumping around, I’m fine with that,” he says. But handstands are ultimately beside the point. “I use the asana as bait to get people to higher things,” he says. “What’s the higher thing? That we’re part of something bigger. And we have to learn how to control our minds.” Accordingly, Raghunath begins and ends his classes with guided meditation, mantra, and chanting accompanied by harmonium and his own voice. Demand for Flight School has been consistent since Raghunath moved from Los Angeles to Manhattan in 2008, where his classes became something of an institution at elite studios. Known for his extreme poses and intense charisma, Raghunath built a following of teachers and inversion-junkies described in a 2012 New York Times profile as “cultlike.” So beloved was Raghunath that when he left Manhattan three years ago, one lifestyle website compared his departure to “Derek Jeter…leaving the city to step out of the limelight.” (In fact, Raghunath had moved upstate with his wife, Bridget, also a yoga teacher, to raise their kids closer to nature). Part of what makes Raghunath so appealing is his origin story, which reads like a mythology of the modern guru. Born Raymond Cappo to a socially conservative family in Connecticut, he moved after high school to the Lower East Side, where he found work at a vegetarian restaurant called Ahimsa—a Sanskrit word meaning “nonviolence” that denotes one of the five yamas, or ethical precepts, of yoga. At 19, he stopped eating meat; the manager of a new age bookstore turned him onto Ayurvedic nutrition and the sacred Hindu scripture the Bhagavad-Gita. He began taking yoga classes in 1987, studying with Sri Dharma Mittra and unrolling his mat next to Jivamukti’s Sharon Gannon at Swami Satchitananda’s Integral Yoga Institute. It wasn’t long before Cappo, who’d grown up studying violin and trumpet and had played in bands in high school, got involved in the Lower East Side’s hardcore punk scene. Even as a teenager, he knew he wanted to reach people. “I was already very intrigued with metaphysics and Eastern thought, and I really appreciated spirituality,” he says. “I wanted to write about substantial things, because I knew that substantial lyrics stood the test of time.” He found a platform as the lead singer and songwriter of Youth of Today, releasing three albums between 1985 and 1988, touring internationally, and founding the punk label Revelation Records. “People say punk rock and they think of the Sex Pistols. But our following—tens of thousands of kids—were vegetarians,” Cappo explains. “We didn’t drink, we didn’t smoke, we believed in positive mental attitudes.” As part of the straight edge movement, Cappo’s music promoted social activism and a politics of radical tolerance. The 1988 video for Youth of Today’s pro-veg anthem “No More,” for example, cuts between a radiantly young Cappo yelling and fist-pumping in cargo shorts and shots of a pig being stabbed (predating fellow musician-yogi Adam Levine’s recent, bloody romp in Maroon 5’s “Animal” by two-and-a-half decades). At 22, Cappo says he received a “strong spiritual calling” after his father passed away suddenly. Burned-out and grieving, he left the band to travel to India. “I had a lack of faith in material culture. Not that I couldn’t get money, but that it was actually fortunate to have money,” he says. Cappo found relief in brahmacharya, the Hindu practice of celibate monkhood, while living at an ashram devoted to bhakti yoga and the deity Krishna. People say punk rock and they think of the Sex Pistols. But our following—tens of thousands of kids—were vegetarians Through daily asana, meditation, and study of the ancient scriptures, Cappo began to refine his understanding of yogic philosophy. In his reading, the Bhagavad-Gita isn’t about renouncing material pleasures so much as “using what you have in a spiritual way. Utility is the principle,” Cappo says. “For example, is money good or bad? Money is just energy. You could use your money to be horrible and self-absorbed. Or you could use money for great things.” At least, that’s what Cappo banked on when he returned to New York City and picked up the mic again in 1990. As the frontman of Shelter, Cappo helped establish a subgenre called krishnacore, a kind of devotional punk rock that melded hardcore’s high-energy noise with lyrics inspired by the International Society for Krishna Consciousness (the “Hare Krishnas”). With Shelter, Cappo saw an opportunity to influence thousands of young fans who, like him, preferred to mosh to music with a positive message—here, a doctrine of radical acceptance and abstinence from meat, drugs, alcohol, and recreational sex. Cappo would continue living as a monk for six and a half years, maintaining his asana and meditation practice (and self-imposed celibacy) while playing shows throughout the U.S., Europe, and South America. “We had a hit record in Brazil, we toured the world three times over, we were on MTV. It was one of those things that became bigger than I thought it was going to be. But because I did it with a different type of internal discipline, that same fame or popularity didn’t fry me.” Regular trips to India helped, too. In 1991 in Vrindavan, a sacred village in the northern province of Uttar Pradesh, Cappo was christened Raghunath, a name invoking the supreme deity Vishnu. Two years later, in the same village, he received upanayana, the ritual sacred thread given to Hindu initiates to recognize the transfer of spiritual knowledge. As the ’90s petered out, so did American interest in krishnacore, prompting Raghunath to find other means of spreading his message. In 2002, a year after Shelter released its last album, Raghunath moved to Los Angeles, where he began teaching yoga and promoting a raw food lifestyle through workshops and cleanses. While he retains the shaven head and inked-up limbs of his krishnacore days, Raghunath has softened considerably his overall vibe since leaving New York. “Because I had that time as a monk and really imbibed those teachings, fame—even within the yoga community—it doesn’t affect me,” he says. He still tours the world, leading yoga workshops and classes on nutrition and the practical applications of yogic philosophy, plus twice-yearly pilgrimages to India, where he guides small groups of yogis through the sacred sites and villages he’s visited since the ’80s. But these days, he tries to spend as much time as possible at home with wife Brij and their five kids, who range from six months to 17 years old. “Family is incredibly grounding for me,” he says, going silent for the first time in half an hour. “I’m one of those people that could travel 365 days a year, just keep traveling and keep teaching because I love to teach so much. But I’d be a little bit ungrounded. So my family brings it back.” Now, after decades of self-searching, Raghunath treats his family with more reverence than he does gravity. This spring, Raghunath and Brij will open their own yoga and meditation center on the grounds of their 11-acre property in East Chatham, New York. Called Super Soul Farm, the center will host public workshops, retreats, and 100- and 200-hour teacher trainings led by Raghunath, Brij, and invited teachers. The Farm has a creek, swim pond, and ample forests, plus a guesthouse and massive yoga studio, a converted three-bay garage. With no television or cell service, guests will be invited to spend their time as the Cappo clan does—reading, cooking, and working on outdoor projects. Recently, Raghunath and his kids built a composting toilet, and he says they opt for campfires and bedtime stories based on the Bhagavad-Gita instead of watching television. For Raghunath, opening Super Soul Farm means a chance to share his life’s work with his children; it’s the next step he’s been waiting for. “I believe that a lot of our potential starts just with dreaming in your highest self,” he says, laying out his philosophy for a connected, successful life. “If you have some basic, strong direction of who you want to become and set that as an internal compass, then wherever you go in this world will always bring you there. I always knew I wanted to be surrounded by nature, I always knew I loved to teach, and I always knew I loved to learn. Generally when you love something, you’re good at it too.” Cover Photo by Robert Sturman By Ellora Vilkin Published on November 8, 2014 TAGS: archive , past to presence , yoga inspiration , yoga instructors", "fetched_at": "2025-09-30T11:28:54.808641", "domain": "www.sonima.com", "text_hash": "sha256:7dc03bdc4ae06be79b83793bfbc737ba5e8027548391db745928d3be6af39f55", "estimated_tokens": 2422}
